"""
Задание 5. Оптимизация функции методом Ньютона

Функция:
    f(x) = x^4 + 3x^3 - 12x^2 + 7x - 2

Требование из задания:
    Начальная точка x0 = 10
    Требуемая точность eps = 0.0001

Запуск:
    poetry run python -m homework_tasks.sessions_tasks.math_analysis.session01.task05_newton_optimization

Пример вывода после запуска:

    ========= ЗАДАНИЕ 5 - Метод Ньютона для экстремума =========
    Старт: x0 = 10.0, eps = 0.0001
    iter |              x |           f(x) |          f'(x) |          f"(x) |       |Δx|
    --------------------------------------------------------------------------------
       1 |     6.55825959 |  2223.93218577 |  1365.00183680 |   610.17789830 |   3.44e+00
       2 |     4.32120406 |   394.91540121 |   394.10233966 |   277.85532803 |   2.24e+00
       3 |     2.90283162 |    61.58892593 |   111.01197067 |   129.36814654 |   1.42e+00
       4 |     2.04472263 |     5.26850226 |    29.74971911 |    62.97569469 |   8.58e-01
       5 |     1.57232261 |    -2.88707725 |     7.06241661 |    33.96818773 |   4.72e-01
       6 |     1.36440994 |    -3.70287982 |     1.16871305 |    22.89875279 |   2.08e-01
       7 |     1.31337166 |    -3.73382203 |     0.06556228 |    20.34003113 |   5.10e-02
       8 |     1.31014834 |    -3.73392797 |     0.00025712 |    20.18053440 |   3.22e-03
       9 |     1.31013560 |    -3.73392798 |     0.00000000 |    20.17990444 |   1.27e-05
    --------------------------------------------------------------------------------
    Результат: x* = 1.31013560, f(x*) = -3.73392798, f'(x*) = 4.013e-09, f''(x*) = 2.018e+01
    Тип точки: локальный минимум
"""


def f(x: float) -> float:
    """
    Задает исходную функцию f(x)
    """
    return x ** 4 + 3 * x ** 3 - 12 * x ** 2 + 7 * x - 2


def df(x: float) -> float:
    """
    Первая производная f'(x).
    Расчет по правилам дифференцирования:
        (x^4)' = 4x^3
        (3x^3)' = 9x^2
        (-12x^2)' = -24x
        (7x)' = 7
        (-2)' = 0
    Результат: 4x^3 + 9x^2 - 24x + 7
    """
    return 4 * x ** 3 + 9 * x ** 2 - 24 * x + 7


def d2f(x: float) -> float:
    """
    Вторая производная f''(x):
        (4x^3)' = 12x^2
        (9x^2)' = 18x
        (-24x)' = -24
        7 -> 0
    Результат: 12x^2 + 18x - 24
    """
    return 12 * x ** 2 + 18 * x - 24


def newton_optimize(x0: float = 10.0, eps: float = 1e-4, max_iter: int = 100) -> tuple[float, int]:
    """
    Реализация метода Ньютона для поиска стационарной точки (экстремума)

    Алгоритм:
        1) На каждой итерации вычисляем f'(x_k) и f''(x_k)
        2) Делаем шаг x_{k+1} = x_k - f'(x_k)/f''(x_k)
        3) Останавливаемся, если |x_{k+1} - x_k| < eps или |f'(x_{k+1})| < eps

    Возвращает:
        (x*, k) - найденная точка и число сделанных итераций
    """
    x = float(x0)
    print("\n========= ЗАДАНИЕ 5 - Метод Ньютона для экстремума =========")
    print(f"Старт: x0 = {x0}, eps = {eps}")
    print(f"{'iter':>4} | {'x':>14} | {'f(x)':>14} | {'f\'(x)':>14} | {'f\"(x)':>14} | {'|Δx|':>10}")
    print("-" * 80)

    for k in range(1, max_iter + 1):
        # Первая производная в текущей точке
        d1 = df(x)
        # Вторая производная в текущей точке
        d2 = d2f(x)

        if abs(d2) < 1e-12:
            # Защита от деления на очень маленькое число.
            raise ZeroDivisionError("Вторая производная близка к нулю - шаг Ньютона невозможен")

        # Формула шага Ньютона
        x_next = x - d1 / d2
        # Величина сдвига по x
        delta = abs(x_next - x)

        print(
            f"{k:>4} | {x_next:>14.8f} | {f(x_next):>14.8f} | {df(x_next):>14.8f} | {d2f(x_next):>14.8f} | {delta:>10.2e}"
        )

        # Критерии остановки: маленький шаг или близкая к нулю производная
        if delta < eps or abs(df(x_next)) < eps:
            x = x_next
            break

        x = x_next

    else:
        # Если цикл не прервался break-ом, значит не сошлось за max_iter
        print("Предупреждение: достигнут лимит итераций, критерий точности завышен")

    print("-" * 80)
    # Классифицируем тип найденной точки по знаку второй производной:
    second = d2f(x)
    if second > 0:
        kind = "локальный минимум"
    elif second < 0:
        kind = "локальный максимум"
    else:
        kind = "не удалось классифицировать (f''(x) = 0)"

    print(f"Результат: x* = {x:.8f}, f(x*) = {f(x):.8f}, f'(x*) = {df(x):.3e}, f''(x*) = {second:.3e}")
    print(f"Тип точки: {kind}")
    return x, k


def main() -> None:
    """
    Точка входа: запускаем Ньютона с параметрами из условия
    """
    newton_optimize(x0=10.0, eps=1e-4, max_iter=100)


if __name__ == "__main__":
    main()
